Case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//    cellDisplacement
//    {
//        solver          PCG;
//        preconditioner  DIC;

//        tolerance       1e-04;
//        relTol          0;
//        maxIter         100;
//    }
    "(p|pcorr)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-4;
        relTol          0.1;
	minIter 1;
	maxIter		100;
    }

    "(p|pcorr)Final"
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }
//    pFinal
//    {
//        relTol 0.01;
//        $p;

//    }
//    pcorr
//    {
//        $p;
//        solver          PCG;
//        preconditioner  DIC;
//    }
//    pcorrFinal
//    {
//        $pcorr;
//        relTol          0;
//    }



    "(U|omega|k)"
    {
        solver          smoothSolver;
        //smoother        symGaussSeidel;
        smoother        DILU;
       // smoother        GaussSeidel;
        tolerance       1e-4;
        relTol          0.01;
        minIter     1;
    }

    "(U|omega|k)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }

  yPsi
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-4;
        relTol          0;
    }
    yWall
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter     1;
    }
}

PIMPLE
{

    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;


}

relaxationFactors
{
    fields
    {
        p               0.7;
        pFinal          0.9;
    }
    equations
    {
        "(U)"   0.7;
        "(U)Final" 0.9;
        "(k|omega|gammaInt|ReThetat|yWall)"   0.7;
        "(k|omega|yWall|gammaInt|ReThetat)Final"   0.9;
    }
}

// ************************************************************************* //
